#```Level 02:

# 1) კომენტარებით ჩამოწერე ყველა მათემატიკური ოპერატორი (+, -, *, /, %, **) და თითოეულზე დაწერე თითო მაგალითი.

# 2) შექმენი ორი ცვლადი num1 და num2, გაუტოლე მნიშვნელობები 30 და 15. დაბეჭდე მათი ჯამი, სხვაობა, ნამრავლი, განაყოფი და ნაშთი.

# 3) შექმენი სამი ცვლადი: a = 10, b = 20, c = 30. დაბეჭდე სამივე რიცხვის ჯამი.

# 4) შექმენი სამი ცვლადი: num1 = 8, num2 = 4, num3 = 2. შეასრულე ოპერაცია (num1 + num2) * num3 და დაბეჭდე შედეგი.

# 5) შექმენი ორი ცვლადი x და y. გაუტოლე მნიშვნელობები 50 და 25. ჯერ იპოვე მათი სხვაობა, შემდეგ მიღებული შედეგი გაამრავლე 2-ზე.

# 6) შექმენი ცვლადი age და შეინახე მნიშვნელობა 18. შემდეგ შექმენი კიდევ ერთი ცვლადი nextAge, რომელიც იქნება age + 1. დაბეჭდე ორივე.

# 7) შექმენი ცვლადი price = 200 და discount = 35. გამოთვალე ფასდაკლების შემდეგ დარჩენილი თანხა და დაბეჭდე.

# 8) შექმენი ცვლადი number = 9. იპოვე მისი კვადრატი (square) და დაბეჭდე შედეგი.

# 9) შექმენი ოთხი ცვლადი: a = 5, b = 10, c = 15, d = 20. დაბეჭდე ყველა რიცხვის ჯამი.

# 10) შექმენი ორი ცვლადი width = 12 და height = 8. გამოთვალე მართკუთხედის ფართობი და დაბეჭდე.```
# #jami=+ 
#svaoba=-
#gamravleba=*
#gayofa=/
# xarisxshi ayvana=**
# procenti=%
print(4+2)
print(4-2)
print(4*2)
print(4/2)
print(4**2)
print(4%2)


num1=30
num2=15

print(30+15)
print(30-15)
print(30*15)
print(30/15)
print(30%15)

a=10
b=20
c=30

print(10+20+30)


num1=8
num2=4
num3=2

print(8+4)*2


x=50
y=25

print(50-25)

print(25*2)

age=18
nextage=+1

print(age)
print(nextage)

price=200
discount=35

print(price-discount)


number=9
square=2

print(9**2)


a=5
b=10
c=15
d=20
 
print(5+10+15+20)

width=12
heigh=8
print(12*8)


