#```level 03:

 # 1) კომენტარებით ახსენით რას აკეთებს ნაშთიანი გაყოფის ოპერატორი ( % ).

 # 2) კომენტარებით ახსენით როგორ უნდა ავიყვანოთ რიცხვი ხარისხში Python-ში.

#  3) შექმენი ცვლადი, სადაც შეინახავ 6-ის მეორე ხარისხს. შემდეგ დაბეჭდე ეს ცვლადი. კომენტარით მიუწერე რა იქნება შედეგი.

#  4) კომენტარებში დაწერე რას გამოიტანს:
- 17 % 5
- 25 % 4
- 30 % 7

#  5) კომენტარებით ახსენით რა არის მონაცემთა ტიპები (Data Types).

#  6) ჩამოწერე Python-ის ძირითადი მონაცემთა ტიპები.

#  7) თითოეულ მონაცემთა ტიპს კომენტარებით მიუწერე განმარტება.

#  8) შექმენი ცვლადი, სადაც შეინახავ შენს სახელს, მეორე ცვლადში შენს ასაკს, ხოლო მესამე ცვლადში იმას, გყავს თუ არა შინაური ცხოველი. შემდეგ დაბეჭდე ყველა ცვლადი.

#  9) შექმენი ცვლადი, სადაც შეინახავ შენი მეგობრის სახელს, მეორე ცვლადში მის ასაკს, ხოლო მესამე ცვლადში მის სიმაღლეს. შემდეგ დაბეჭდე ყველა ცვლადი.

#  10) შექმენი ორი რიცხვითი ცვლადი. იპოვე მათი ჯამი, სხვაობა, ნამრავლი, განაყოფი და ნაშთი. თითოეული შედეგი დაბეჭდე.

#  11) შექმენი ცვლადი number, სადაც შეინახავ ნებისმიერ რიცხვს. აიყვანე ის მესამე ხარისხში და დაბეჭდე შედეგი.

#  12) შექმენი Boolean ტიპის ორი ცვლადი: ერთში შეინახე True, მეორეში False. შემდეგ ორივე დაბეჭდე.

#  13) კომენტარებით ახსენით რა განსხვავებაა int-სა და float-ს შორის.

#  14) შექმენი ცვლადი `price`, სადაც შეინახავ პროდუქტის ფასს, და ცვლადი `quantity`, სადაც შეინახავ რაოდენობას. გამოთვალე საერთო ღირებულება და დაბეჭდე.

#  15) კომენტარებით ახსენით რისთვის გამოიყენება print() ფუნქცია Python-ში```

#1 % aris nashtiani gayofis operatori is ar gvazlevs pasuxs aramed gvazlevs nashts
#2 ricxvis xarisxshi ayvana nishnavs rom erti da igive ricxvi ramdemenjerme gaamravlo
#3 number = 6**2 
print(17%5)
print (25%4) 
print (30%7)
#5 level 3:
# data type - მონაცემთა ტიპები.
# str-string---ნებისმიერი იმფორაცია რომელიც არის მოცემული ""-ში  .
# integer-int-ნებისმიერი მთელი რიცხვი როგორებიცა--- 1,2,3,4,5,6... ა.შ.
# float-რიცხვები რომლებიც არის ჩაწერილი ათწილადად ანუ ჭირდება წერტილი რიცხვის ჩაწერის
#დროს არის float მაგ: 1.2; 3.14; 4.13; 4.55555555; ა.შ.
#Boolean-bool-აქვს მხოლოდ ორი მნიშვნელობა True or False
#6 
age=12 
height=1.50
name= "gabriel"
is_student=True 
print(age)
print(height)
print(name)
print(is_student)
#7 data type - მონაცემთა ტიპები.
# str-string---ნებისმიერი იმფორაცია რომელიც არის მოცემული ""-ში  .
# integer-int-ნებისმიერი მთელი რიცხვი როგორებიცა--- 1,2,3,4,5,6... ა.შ.
# float-რიცხვები რომლებიც არის ჩაწერილი ათწილადად ანუ ჭირდება წერტილი რიცხვის ჩაწერის
#დროს არის float მაგ: 1.2; 3.14; 4.13; 4.55555555; ა.შ.
#Boolean-bool-აქვს მხოლოდ ორი მნიშვნელობა True or False
#8 name=gabriel
age1= 12 
height1=1.50
has_pet=False
print(name)
print(age)
print(height)
print(has_pet)
#9
name2 = "misho"
age2= 15
height2=1.70
print (name2)
print(age2)
print(height2)
#10
a=10 
b=3 
print(a+b)
print(a-b)
print(a*b)
print(a/b)
#11 
number=25 **3
print(25**3)
#12
gabriel_is_student=True
gabrieli_is_12_wlis=False
print(gabriel_is_student)
print(gabrieli_is_12_wlis)
#13 int =ნებისმიერი მთელი რიცხვი როგორებიცა--- 1,2,3,4,5,6... ა.შ.
#float იცხვები რომლებიც არის ჩაწერილი ათწილადად ანუ ჭირდება წერტილი რიცხვის ჩაწერის
#დროს არის float მაგ: 1.2; 3.14; 4.13; 4.55555555; ა.შ. 
#14 
price=20 
quantity=30
print (price*quantity)
#15 print gamoiyeneba ekranze informaciis gamosatanad 