# Level 04


# 1) კომენტარების სახით ახსენით რა არის input ფუნქცია და რისთვის გამოიყენება
# input() ფუნქცია გამოიყენება მომხმარებლისგან ინფორმაციის შესატანად.
# მომხმარებელი წერს ინფორმაციას კლავიატურიდან და input() მას იღებს.


# 2) მომხმარებელს შემოატანინე თავისი სახელი და დაბეჭდე რა სახელი შემოიტანა
name = input("შეიყვანე შენი სახელი: ")
print(name)


# 3) მომხმარებელს შემოატანინე თავისი საყვარელი ფერი და დაბეჭდეთ
color = input("შეიყვანე შენი საყვარელი ფერი: ")
print(color)


# 4) კომენტარებით ახსენით რა არის f-string
# f-string არის ტექსტში ცვლადის მნიშვნელობის ჩასმის მარტივი გზა.
# f-string-ის გამოსაყენებლად ტექსტის წინ ვწერთ ასო f-ს,
# ხოლო ცვლადს ვსვამთ { } ფრჩხილებში.
# მაგალითად: f"Hello {name}"


# 5) მომხმარებელს შემოატანინე თავისი ასაკი და დაბეჭდეთ f-string-ით
# "I am {მომხმარებლის ასაკი აქ} years old"
age = input("შეიყვანე შენი ასაკი: ")

print(f"I am {age} years old")
